# Словник кольорів фону для різних кодів погоди
bg_colors = {
    # Сонячна
    "01d": ["#87CEFA", "#FFDF56"],
    "02d": ["#87CEFA", "#FFDF56"],
    
    # Ніч
    "01n": ["#191970", "#8A2BE2"],
    "02n": ["#191970", "#8A2BE2"],
    
    # Мала хмарність
    "03d": ["#C0C0C0", "#FFD27F"],
    "03n": ["#696969", "#9974BC"],
    
    # Хмарність
    "04d": ["#A9A9A9", "#696969"],
    "04n": ["#A9A9A9", "#696969"],
    
    # Дощ
    "09d": ["#808080", "#5DACE2"],
    "09n": ["#808080", "#5DACE2"],
    "10d": ["#808080", "#5DACE2"],
    "10n": ["#808080", "#5DACE2"],
    
    # Злива
    "11d": ["#4A4A4A", "#5DACE2"],
    "11n": ["#4A4A4A", "#5DACE2"],
    
    # Сніг
    "13d": ["#FFFFFF", "#B0C4DE"],
    "13n": ["#FFFFFF", "#B0C4DE"],
}

def get_bg_colors(icon_code):
    """Повертає кольори градієнту для коду погоди"""
    if icon_code in bg_colors:
        return bg_colors[icon_code]
    else:
        # Стандартний градієнт, якщо код не знайдено
        return ["#8A2BE2", "#191970"]